cfd/gold_v2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  14
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 -0)
    (0.731648018 0.0660373372 -0.00288325241)
    (0.731648018 0.0660373372 0.00288325241)
    (0.895 0.0498439672 -0.0021762346)
    (0.895 0.0498439672 0.0021762346)
    (0.907 0.0464492064 -0.00202801615)
    (0.907 0.0464492064 0.00202801615)
    (0.913102521 0.0445420153 -0.00194474639)
    (0.913102521 0.0445420153 0.00194474639)
    (1 0 -0)
    (-4 0 -0)
    (0.731648018 3.9904332 -0.174226076)
    (0.731648018 3.9904332 0.174226076)
    (0.895 3.99531163 -0.174439073)
    (0.895 3.99531163 0.174439073)
    (0.907 3.99550157 -0.174447366)
    (0.907 3.99550157 0.174447366)
    (0.913102521 3.99558932 -0.174451197)
    (0.913102521 3.99558932 0.174451197)
    (1 3.99619289 -0.174477549)
    (1 3.99619289 0.174477549)
    (8 0 -0)
    (8 3.99619289 -0.174477549)
    (8 3.99619289 0.174477549)
);

blocks
(
    hex (0 1 11 10 0 2 12 10) (110 110 1)
    edgeGrading (((0.3 0.4 6) (0.7 0.6 3)) ((0.3 0.4 6) (0.7 0.6 3)) ((0.3 0.4 6) (0.7 0.6 3)) ((0.3 0.4 6) (0.7 0.6 3))  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (1 3 13 11 2 4 14 12) (70 110 1)
    edgeGrading (((0.7 0.6 1) (0.3 0.4 0.15)) ((0.7 0.6 1) (0.3 0.4 0.15)) ((0.7 0.6 1) (0.3 0.4 0.15)) ((0.7 0.6 1) (0.3 0.4 0.15))  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (3 5 15 13 4 6 16 14) (16 110 1)
    edgeGrading (1 1 1 1  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (5 7 17 15 6 8 18 16) (12 110 1)
    edgeGrading (1 1 1 1  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (7 9 19 17 8 9 20 18) (60 110 1)
    edgeGrading (((0.3 0.5 3) (0.7 0.5 0.3)) ((0.3 0.5 3) (0.7 0.5 0.3)) ((0.3 0.5 3) (0.7 0.5 0.3)) ((0.3 0.5 3) (0.7 0.5 0.3))  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
    hex (9 21 22 19 9 21 23 20) (160 110 1)
    edgeGrading (40 40 40 40  ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097)) ((0.012764 0.545455 1736.79) (0.987236 0.454545 43.4097))  1 1 1 1)
);

edges
(
...
    polyLine 10 11 ((-3.99315973 0.208960684 -0.00912342048) (-3.97265762 0.417349628 -0.0182218783) (-3.93854978 0.624596659 -0.0272704791) (-3.89092953 0.830134724 -0.0362444648) (-3.82992716 1.03340145 -0.0451192817) (-3.75570958 1.23384068 -0.0538706474) (-3.66847986 1.43090398 -0.062474617) (-3.56847667 1.62405218 -0.0709076493) (-3.45597363 1.81275678 -0.0791466705) (-3.33127856 1.99650149 -0.0871691377) (-3.19473263 2.17478356 -0.0949531007) (-3.04670946 2.34711517 -0.102477262) (-2.88761405 2.51302483 -0.109721033) (-2.7178817 2.67205857 -0.116664597) (-2.53797682 2.82378127 -0.123288953) (-2.34839165 2.96777779 -0.129575977) (-2.14964491 3.10365415 -0.135508467) (-1.9422804 3.23103857 -0.141070191) (-1.72686549 3.34958252 -0.146245931) (-1.50398958 3.45896164 -0.151021527) (-1.27426248 3.55887667 -0.155383911) (-1.03831274 3.64905422 -0.159321148) (-0.796785965 3.72924756 -0.162822465) (-0.550342983 3.79923727 -0.165878282) (-0.299658093 3.85883185 -0.168480237) (-0.0454171965 3.90786825 -0.170621212) (0.211684076 3.94621229 -0.172295349) (0.470942267 3.97375906 -0.173498068))
...
    polyLine 10 12 ((-3.99315973 0.208960684 0.00912342048) (-3.97265762 0.417349628 0.0182218783) (-3.93854978 0.624596659 0.0272704791) (-3.89092953 0.830134724 0.0362444648) (-3.82992716 1.03340145 0.0451192817) (-3.75570958 1.23384068 0.0538706474) (-3.66847986 1.43090398 0.062474617) (-3.56847667 1.62405218 0.0709076493) (-3.45597363 1.81275678 0.0791466705) (-3.33127856 1.99650149 0.0871691377) (-3.19473263 2.17478356 0.0949531007) (-3.04670946 2.34711517 0.102477262) (-2.88761405 2.51302483 0.109721033) (-2.7178817 2.67205857 0.116664597) (-2.53797682 2.82378127 0.123288953) (-2.34839165 2.96777779 0.129575977) (-2.14964491 3.10365415 0.135508467) (-1.9422804 3.23103857 0.141070191) (-1.72686549 3.34958252 0.146245931) (-1.50398958 3.45896164 0.151021527) (-1.27426248 3.55887667 0.155383911) (-1.03831274 3.64905422 0.159321148) (-0.796785965 3.72924756 0.162822465) (-0.550342983 3.79923727 0.165878282) (-0.299658093 3.85883185 0.168480237) (-0.0454171965 3.90786825 0.170621212) (0.211684076 3.94621229 0.172295349) (0.470942267 3.97375906 0.173498068))
    polyLine 1 3 ((0.736275382 0.0660310368 -0.00288297733) (0.740876837 0.0660108719 -0.00288209691) (0.745451877 0.0659762914 -0.00288058709) (0.75 0.0659267457 -0.00287842388) (0.754520708 0.0658616876 -0.00287558338) (0.759013505 0.065780574 -0.00287204188) (0.763477898 0.0656828676 -0.00286777593) (0.767913397 0.0655680384 -0.00286276238) (0.772319518 0.0654355651 -0.00285697847) (0.776695775 0.0652849369 -0.0028504019) (0.781041689 0.0651156549 -0.00284301089) (0.785356784 0.0649272341 -0.00283478426) (0.789640586 0.0647192048 -0.00282570151) (0.793892626 0.0644911144 -0.00281574286) (0.798112437 0.0642425287 -0.00280488938) (0.802299557 0.063973034 -0.00279312298) (0.806453527 0.0636822384 -0.00278042658) (0.81057389 0.0633697738 -0.00276678408) (0.814660196 0.0630352968 -0.0027521805) (0.818711995 0.0626784912 -0.00273660203) (0.822728844 0.0622990686 -0.00272003608) (0.826710302 0.0618967706 -0.00270247137) (0.830655933 0.0614713699 -0.00268389797) (0.834565303 0.0610226718 -0.00266430739) (0.838437985 0.0605505157 -0.00264369261) (0.842273553 0.0600547761 -0.00262204815) (0.846071587 0.0595353641 -0.00259937013) (0.84983167 0.0589922286 -0.00257565633) (0.853553391 0.0584253572 -0.00255090618) (0.85723634 0.0578347774 -0.00252512091) (0.860880114 0.0572205574 -0.00249830349) (0.864484314 0.0565828075 -0.00247045873) (0.868048544 0.05592168 -0.00244159328) (0.871572413 0.0552373708 -0.00241171569) (0.875055535 0.0545301195 -0.00238083643) (0.878497528 0.0538002099 -0.00234896789) (0.881898014 0.053047971 -0.00231612443) (0.885256621 0.0522737764 -0.00228232237) (0.888572981 0.0514780455 -0.00224758001) (0.891846729 0.050661243 -0.00221191764))
    polyLine 11 13 ((0.737277071 3.99067246 -0.174236523) (0.742906459 3.99090666 -0.174246748) (0.748536174 3.99113578 -0.174256751) (0.754166208 3.99135983 -0.174266533) (0.759796554 3.9915788 -0.174276094) (0.765427206 3.9917927 -0.174285433) (0.771058156 3.99200153 -0.174294551) (0.776689397 3.99220528 -0.174303447) (0.782320922 3.99240396 -0.174312122) (0.787952724 3.99259757 -0.174320575) (0.793584795 3.9927861 -0.174328806) (0.799217128 3.99296956 -0.174336816) (0.804849717 3.99314794 -0.174344604) (0.810482554 3.99332124 -0.174352171) (0.816115631 3.99348947 -0.174359516) (0.821748943 3.99365262 -0.174366639) (0.82738248 3.9938107 -0.174373541) (0.833016238 3.9939637 -0.174380221) (0.838650207 3.99411163 -0.17438668) (0.844284382 3.99425447 -0.174392917) (0.849918754 3.99439225 -0.174398932) (0.855553318 3.99452494 -0.174404725) (0.861188064 3.99465256 -0.174410297) (0.866822988 3.9947751 -0.174415647) (0.87245808 3.99489256 -0.174420776) (0.878093335 3.99500494 -0.174425683) (0.883728745 3.99511225 -0.174430368) (0.889364302 3.99521448 -0.174434831))
    polyLine 2 4 ((0.736275382 0.0660310368 0.00288297733) (0.740876837 0.0660108719 0.00288209691) (0.745451877 0.0659762914 0.00288058709) (0.75 0.0659267457 0.00287842388) (0.754520708 0.0658616876 0.00287558338) (0.759013505 0.065780574 0.00287204188) (0.763477898 0.0656828676 0.00286777593) (0.767913397 0.0655680384 0.00286276238) (0.772319518 0.0654355651 0.00285697847) (0.776695775 0.0652849369 0.0028504019) (0.781041689 0.0651156549 0.00284301089) (0.785356784 0.0649272341 0.00283478426) (0.789640586 0.0647192048 0.00282570151) (0.793892626 0.0644911144 0.00281574286) (0.798112437 0.0642425287 0.00280488938) (0.802299557 0.063973034 0.00279312298) (0.806453527 0.0636822384 0.00278042658) (0.81057389 0.0633697738 0.00276678408) (0.814660196 0.0630352968 0.0027521805) (0.818711995 0.0626784912 0.00273660203) (0.822728844 0.0622990686 0.00272003608) (0.826710302 0.0618967706 0.00270247137) (0.830655933 0.0614713699 0.00268389797) (0.834565303 0.0610226718 0.00266430739) (0.838437985 0.0605505157 0.00264369261) (0.842273553 0.0600547761 0.00262204815) (0.846071587 0.0595353641 0.00259937013) (0.84983167 0.0589922286 0.00257565633) (0.853553391 0.0584253572 0.00255090618) (0.85723634 0.0578347774 0.00252512091) (0.860880114 0.0572205574 0.00249830349) (0.864484314 0.0565828075 0.00247045873) (0.868048544 0.05592168 0.00244159328) (0.871572413 0.0552373708 0.00241171569) (0.875055535 0.0545301195 0.00238083643) (0.878497528 0.0538002099 0.00234896789) (0.881898014 0.053047971 0.00231612443) (0.885256621 0.0522737764 0.00228232237) (0.888572981 0.0514780455 0.00224758001) (0.891846729 0.050661243 0.00221191764))
    polyLine 12 14 ((0.737277071 3.99067246 0.174236523) (0.742906459 3.99090666 0.174246748) (0.748536174 3.99113578 0.174256751) (0.754166208 3.99135983 0.174266533) (0.759796554 3.9915788 0.174276094) (0.765427206 3.9917927 0.174285433) (0.771058156 3.99200153 0.174294551) (0.776689397 3.99220528 0.174303447) (0.782320922 3.99240396 0.174312122) (0.787952724 3.99259757 0.174320575) (0.793584795 3.9927861 0.174328806) (0.799217128 3.99296956 0.174336816) (0.804849717 3.99314794 0.174344604) (0.810482554 3.99332124 0.174352171) (0.816115631 3.99348947 0.174359516) (0.821748943 3.99365262 0.174366639) (0.82738248 3.9938107 0.174373541) (0.833016238 3.9939637 0.174380221) (0.838650207 3.99411163 0.17438668) (0.844284382 3.99425447 0.174392917) (0.849918754 3.99439225 0.174398932) (0.855553318 3.99452494 0.174404725) (0.861188064 3.99465256 0.174410297) (0.866822988 3.9947751 0.174415647) (0.87245808 3.99489256 0.174420776) (0.878093335 3.99500494 0.174425683) (0.883728745 3.99511225 0.174430368) (0.889364302 3.99521448 0.174434831))
    polyLine 3 5 ((0.895077506 0.0498238788 -0.00217535753) (0.898264959 0.0489665087 -0.00213792394) (0.901408738 0.0480897333 -0.0020996431) (0.904508497 0.0471941983 -0.0020605432))
    polyLine 13 15 ((0.895413783 3.99531856 -0.174439376) (0.895827568 3.99532547 -0.174439677) (0.896241352 3.99533234 -0.174439977) (0.896655138 3.9953392 -0.174440277) (0.897068924 3.99534602 -0.174440574) (0.897482711 3.99535281 -0.174440871) (0.897896499 3.99535958 -0.174441167) (0.898310287 3.99536632 -0.174441461) (0.898724076 3.99537304 -0.174441754) (0.899137866 3.99537972 -0.174442046) (0.899551657 3.99538638 -0.174442337) (0.899965448 3.99539302 -0.174442626) (0.90037924 3.99539962 -0.174442915) (0.900793032 3.9954062 -0.174443202) (0.901206825 3.99541275 -0.174443488) (0.901620619 3.99541927 -0.174443773) (0.902034414 3.99542576 -0.174444056) (0.902448209 3.99543223 -0.174444339) (0.902862005 3.99543867 -0.17444462) (0.903275801 3.99544508 -0.1744449) (0.903689599 3.99545147 -0.174445178) (0.904103397 3.99545783 -0.174445456) (0.904517195 3.99546416 -0.174445732) (0.904930994 3.99547046 -0.174446008) (0.905344794 3.99547674 -0.174446282) (0.905758595 3.99548298 -0.174446554) (0.906172396 3.99548921 -0.174446826) (0.906586198 3.9954954 -0.174447096))
    polyLine 4 6 ((0.895077506 0.0498238788 0.00217535753) (0.898264959 0.0489665087 0.00213792394) (0.901408738 0.0480897333 0.0020996431) (0.904508497 0.0471941983 0.0020605432))
    polyLine 14 16 ((0.895413783 3.99531856 0.174439376) (0.895827568 3.99532547 0.174439677) (0.896241352 3.99533234 0.174439977) (0.896655138 3.9953392 0.174440277) (0.897068924 3.99534602 0.174440574) (0.897482711 3.99535281 0.174440871) (0.897896499 3.99535958 0.174441167) (0.898310287 3.99536632 0.174441461) (0.898724076 3.99537304 0.174441754) (0.899137866 3.99537972 0.174442046) (0.899551657 3.99538638 0.174442337) (0.899965448 3.99539302 0.174442626) (0.90037924 3.99539962 0.174442915) (0.900793032 3.9954062 0.174443202) (0.901206825 3.99541275 0.174443488) (0.901620619 3.99541927 0.174443773) (0.902034414 3.99542576 0.174444056) (0.902448209 3.99543223 0.174444339) (0.902862005 3.99543867 0.17444462) (0.903275801 3.99544508 0.1744449) (0.903689599 3.99545147 0.174445178) (0.904103397 3.99545783 0.174445456) (0.904517195 3.99546416 0.174445732) (0.904930994 3.99547046 0.174446008) (0.905344794 3.99547674 0.174446282) (0.905758595 3.99548298 0.174446554) (0.906172396 3.99548921 0.174446826) (0.906586198 3.9954954 0.174447096))
    polyLine 5 7 ((0.907563898 0.0462805936 -0.00202065435) (0.910574605 0.0453496532 -0.00198000862))
    polyLine 15 17 ((0.90721043 3.99550469 -0.174447502) (0.907420859 3.99550781 -0.174447638) (0.907631289 3.99551092 -0.174447774) (0.907841719 3.99551402 -0.17444791) (0.908052149 3.99551712 -0.174448045) (0.908262579 3.99552021 -0.17444818) (0.90847301 3.99552329 -0.174448314) (0.908683441 3.99552637 -0.174448449) (0.908893871 3.99552944 -0.174448583) (0.909104302 3.9955325 -0.174448716) (0.909314734 3.99553555 -0.17444885) (0.909525165 3.9955386 -0.174448983) (0.909735596 3.99554164 -0.174449115) (0.909946028 3.99554467 -0.174449248) (0.91015646 3.9955477 -0.17444938) (0.910366892 3.99555072 -0.174449512) (0.910577324 3.99555373 -0.174449643) (0.910787756 3.99555674 -0.174449775) (0.910998188 3.99555973 -0.174449905) (0.911208621 3.99556272 -0.174450036) (0.911419054 3.99556571 -0.174450166) (0.911629487 3.99556868 -0.174450296) (0.91183992 3.99557165 -0.174450426) (0.912050353 3.99557462 -0.174450555) (0.912260786 3.99557757 -0.174450684) (0.91247122 3.99558052 -0.174450813) (0.912681653 3.99558346 -0.174450941) (0.912892087 3.99558639 -0.174451069))
    polyLine 6 8 ((0.907563898 0.0462805936 0.00202065435) (0.910574605 0.0453496532 0.00198000862))
    polyLine 16 18 ((0.90721043 3.99550469 0.174447502) (0.907420859 3.99550781 0.174447638) (0.907631289 3.99551092 0.174447774) (0.907841719 3.99551402 0.17444791) (0.908052149 3.99551712 0.174448045) (0.908262579 3.99552021 0.17444818) (0.90847301 3.99552329 0.174448314) (0.908683441 3.99552637 0.174448449) (0.908893871 3.99552944 0.174448583) (0.909104302 3.9955325 0.174448716) (0.909314734 3.99553555 0.17444885) (0.909525165 3.9955386 0.174448983) (0.909735596 3.99554164 0.174449115) (0.909946028 3.99554467 0.174449248) (0.91015646 3.9955477 0.17444938) (0.910366892 3.99555072 0.174449512) (0.910577324 3.99555373 0.174449643) (0.910787756 3.99555674 0.174449775) (0.910998188 3.99555973 0.174449905) (0.911208621 3.99556272 0.174450036) (0.911419054 3.99556571 0.174450166) (0.911629487 3.99556868 0.174450296) (0.91183992 3.99557165 0.174450426) (0.912050353 3.99557462 0.174450555) (0.912260786 3.99557757 0.174450684) (0.91247122 3.99558052 0.174450813) (0.912681653 3.99558346 0.174450941) (0.912892087 3.99558639 0.174451069))
...
    polyLine 17 19 ((0.9160987 3.99563023 -0.174452983) (0.919094908 3.9956697 -0.174454707) (0.922091146 3.99570774 -0.174456367) (0.925087412 3.99574434 -0.174457965) (0.928083704 3.9957795 -0.174459501) (0.931080023 3.99581323 -0.174460973) (0.934076366 3.99584553 -0.174462383) (0.937072733 3.99587639 -0.174463731) (0.940069122 3.99590581 -0.174465016) (0.943065533 3.9959338 -0.174466238) (0.946061964 3.99596036 -0.174467397) (0.949058415 3.99598547 -0.174468494) (0.952054884 3.99600916 -0.174469528) (0.955051371 3.99603141 -0.174470499) (0.958047873 3.99605222 -0.174471408) (0.961044391 3.9960716 -0.174472254) (0.964040922 3.99608954 -0.174473037) (0.967037467 3.99610605 -0.174473758) (0.970034023 3.99612112 -0.174474416) (0.97303059 3.99613475 -0.174475011) (0.976027167 3.99614695 -0.174475544) (0.979023752 3.99615772 -0.174476014) (0.982020345 3.99616705 -0.174476421) (0.985016944 3.99617494 -0.174476766) (0.988013549 3.9961814 -0.174477048) (0.991010158 3.99618643 -0.174477267) (0.99400677 3.99619002 -0.174477424) (0.997003385 3.99619217 -0.174477518))
...
    polyLine 18 20 ((0.9160987 3.99563023 0.174452983) (0.919094908 3.9956697 0.174454707) (0.922091146 3.99570774 0.174456367) (0.925087412 3.99574434 0.174457965) (0.928083704 3.9957795 0.174459501) (0.931080023 3.99581323 0.174460973) (0.934076366 3.99584553 0.174462383) (0.937072733 3.99587639 0.174463731) (0.940069122 3.99590581 0.174465016) (0.943065533 3.9959338 0.174466238) (0.946061964 3.99596036 0.174467397) (0.949058415 3.99598547 0.174468494) (0.952054884 3.99600916 0.174469528) (0.955051371 3.99603141 0.174470499) (0.958047873 3.99605222 0.174471408) (0.961044391 3.9960716 0.174472254) (0.964040922 3.99608954 0.174473037) (0.967037467 3.99610605 0.174473758) (0.970034023 3.99612112 0.174474416) (0.97303059 3.99613475 0.174475011) (0.976027167 3.99614695 0.174475544) (0.979023752 3.99615772 0.174476014) (0.982020345 3.99616705 0.174476421) (0.985016944 3.99617494 0.174476766) (0.988013549 3.9961814 0.174477048) (0.991010158 3.99618643 0.174477267) (0.99400677 3.99619002 0.174477424) (0.997003385 3.99619217 0.174477518))
);

defaultPatch { name defaultFaces; type empty; }

boundary
(
    corpo { type wall; faces ((0 1 2 0) (1 3 4 2) (7 9 9 8)); }
    esterno { type patch; faces ((10 11 12 10) (11 13 14 12) (13 15 16 14) (15 17 18 16) (17 19 20 18) (19 22 23 20)); }
    front { type wedge; faces ((0 1 11 10) (1 3 13 11) (3 5 15 13) (5 7 17 15) (7 9 19 17) (9 21 22 19)); }
    back { type wedge; faces ((0 10 12 2) (2 12 14 4) (4 14 16 6) (6 16 18 8) (8 18 20 9) (9 20 23 21)); }
    presa { type patch; faces ((3 5 6 4)); }
    scarico { type patch; faces ((5 7 8 6)); }
    uscita { type patch; faces ((21 22 23 21)); }
);
